system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-10.0 0.0 -2.0)
	(10.0 0.0 -2.0)
	(10.0 5.0 -2.0)
	(-10.0 5.0 -2.0)
	(-10.0 0.0 1.0)
	(10.0 0.0 1.0)
	(10.0 5.0 1.0)
	(-10.0 5.0 1.0)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (55 14 13) simpleGrading (1.0 1.0 1.0)
);
edges	();
boundary	(
	inlet
	{
		type	patch;
		faces	(
			(0 4 7 3)
		);
	}
	outlet
	{
		type	patch;
		faces	(
			(2 6 5 1)
		);
	}
	symmetry
	{
		type	symmetry;
		faces	(
			(1 5 4 0)
			(3 7 6 2)
		);
	}
	bottom
	{
		type	wall;
		faces	(
			(0 3 2 1)
		);
	}
	top
	{
		type	patch;
		faces	(
			(4 5 6 7)
		);
	}
);
