system/createPatchDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	createPatchDict;
}
pointSync	false;
patches	(
	{
		name	Boat;
		patchInfo
		{
			type	wall;
		}
		constructFrom	patches;
		patches	(Boat_face_0 Boat_face_1 Boat_face_2);
	}
);
