constant/transportProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	transportProperties;
}
phases	(phase1 phase2);
phase1
{
	rho	998.0;
	transportModel	Newtonian;
	nu	nu [0 2 -1 0 0 0 0] 1.0E-6;
}
phase2
{
	rho	1.21;
	transportModel	Newtonian;
	nu	nu [0 2 -1 0 0 0 0] 1.51E-5;
}
sigma	sigma [1 0 -2 0 0 0 0] 0.07;
