0/p_rgh
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	p_rgh;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 0.0;
boundaryField
{
	inlet
	{
		type	fixedFluxPressure;
	}
	outlet
	{
		type	zeroGradient;
	}
	symmetry
	{
		type	symmetry;
	}
	bottom
	{
		type	fixedFluxPressure;
	}
	top
	{
		type	totalPressure;
		p0	uniform 0.0;
		rho	rho;
		phi	rhoPhi;
		gamma	0;
	}
	Boat
	{
		type	fixedFluxPressure;
	}
}
