0/omega
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	omega;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 -1 0 0 0 0];
internalField	uniform 1.0;
boundaryField
{
	inlet
	{
		type	turbulentMixingLengthFrequencyInlet;
		value	uniform 1.0;
		phi	rhoPhi;
		mixingLength	0.001;
	}
	outlet
	{
		type	zeroGradient;
	}
	symmetry
	{
		type	symmetry;
	}
	bottom
	{
		type	omegaWallFunction;
		value	uniform 1.0;
	}
	top
	{
		type	turbulentMixingLengthFrequencyInlet;
		value	uniform 1.0;
		phi	rhoPhi;
		mixingLength	0.001;
	}
	Boat
	{
		type	omegaWallFunction;
		value	uniform 1.0;
	}
}
