0/pointDisplacement
FoamFile
{
	version	2.0;
	format	binary;
	class	pointVectorField;
	location	"0";
	object	pointDisplacement;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 1 0 0 0 0 0];
internalField	uniform (0.0 0.0 0.0);
boundaryField
{
	inlet
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}
	outlet
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}
	symmetry
	{
		type	symmetry;
	}
	bottom
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}
	top
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}
	Boat
	{
		type	calculated;
		value	uniform (0.0 0.0 0.0);
	}
}
